package nwk02.swing;
/*
 * Date : 2015. 6. 3
 * Author : 이재우
 * */
/*
 스윙(Swing) 은 AWT 의 제약을 극복하기 위하여 만들어졌다.
 (*java의 로직이 어떻게 해서 화면에 구현되는가를 아는가가 중요)
 
 자바에서 GUI(Graphic User Interface) 를 구현하기 위해
 JDK 에서 기본적으로 제공하는 기본 툴킷으로
 선 마이크로 시스템외 자바 기반 클래스의 일부이다.
 현재는 오라클로 인수되었다.
 
 스윙은 기존에 발표되었던 AWT 가 OS 및 윈도우 시스템의 지원을
 그대로 제공하기 때문에 자바에서 지향하는 "Write Once, Run Everywhere" 를
 구현하기 힘들었다.
 따라서, 각종 시스템에서 공통적으로 제공하는 버튼, 대화창 틀만을 구현하고
 표나 트리등외 좀 더 복잡하고 다양한 그래픽 콤퍼넌트를 사용할 수 없는
 단점을 보완하기 위해 JDK1.2 버전부터 사용되었다.
 참고로 JDK1.2 를 자바2 라고 부르며
 현재는 자바8 버전까지 나왔다.
 * */
public class SwingSyntax {

}
